"""Написати функцію < bank > , яка працює за наступною логікою: 
користувач робить вклад у розмірі < a > одиниць строком на < years > років під < percents > відсотків 
(кожен рік сума вкладу збільшується на цей відсоток, ці гроші додаються до суми вкладу і в наступному 
році на них також нараховуються відсотки). Параметр < percents > є необов'язковим і має значення по замовчуванню < 10 > (10%).
 Функція повинна принтануть і вернуть суму, яка буде на рахунку."""


def bank(a, year, percents = 10):
	sum_a = a
	for _ in range(1, year+1):
		sum_a = sum_a*(percents/100) + sum_a
		
	print(sum_a)
	return sum_a
	
balance = float(input('Сумма:'))
year = int(input('На сколько лет:'))
try:
	per = float(input('Проценты:'))

except ValueError:
	per = 10

bank(balance, year, per)