"""Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), 
пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
-  Повиннi опрацювати такi умови:
-  x > y;       вiдповiдь - х бiльше нiж у на z
-  x < y;       вiдповiдь - у бiльше нiж х на z
-  x == y.      вiдповiдь - х дорiвнює z"""


x = int(input())
y = int(input())

def difference_con(x, y):
	if x > y:
		return f'х бiльше нiж у на {x-y}'
	elif x < y:
		return f'у бiльше нiж х на {y-x}' 
	elif x == y:
		return 'х дорiвнює y'
		
print(difference_con(x, y))
